In [2]:
import numpy as np 
import pandas as pd

In [3]:
data = {'rollNo': [101, 105, 109], 'name': ['ram', 'shyam', 'amit'], 'section': ['c', 'd', 'c']}

In [4]:
data

{'rollNo': [101, 105, 109],
 'name': ['ram', 'shyam', 'amit'],
 'section': ['c', 'd', 'c']}

In [5]:
d_frame = pd.DataFrame(data)

In [6]:
d_frame

   rollNo   name section
0     101    ram       c
1     105  shyam       d
2     109   amit       c

In [7]:
d_frame.head()

   rollNo   name section
0     101    ram       c
1     105  shyam       d
2     109   amit       c

In [8]:
d_frame = pd.DataFrame(data, columns=['name', 'section'])

In [9]:
d_frame

    name section
0    ram       c
1  shyam       d
2   amit       c

Arbitrary Indices

In [10]:
d_frame = pd.DataFrame(data, index=[100, 200, 300])
d_frame

     rollNo   name section
100     101    ram       c
200     105  shyam       d
300     109   amit       c

String as indices

In [11]:
d_frame = pd.DataFrame(data, index=['first', 'second', 'third'])
d_frame

        rollNo   name section
first      101    ram       c
second     105  shyam       d
third      109   amit       c

In [12]:
my_frame = pd.DataFrame(np.arange(16).reshape(4,4), index=[100, 200, 300, 400], columns=['one', 'two', 'three', 'four'])
my_frame

     one  two  three  four
100    0    1      2     3
200    4    5      6     7
300    8    9     10    11
400   12   13     14    15

In [13]:
my_frame.columns

Index(['one', 'two', 'three', 'four'], dtype='object')

In [14]:
my_frame.index

Index([100, 200, 300, 400], dtype='int64')

In [15]:
my_frame.values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [16]:
my_frame['three']

100     2
200     6
300    10
400    14
Name: three, dtype: int32

# row-wise slicing

In [17]:
my_frame.loc[200]

one      4
two      5
three    6
four     7
Name: 200, dtype: int32

In [18]:
my_frame = pd.DataFrame(np.arange(16).reshape(4,4), index=[100, 200, 300, 400], columns=['col1', 'col2', 'col3', 'col4'])

In [19]:
my_frame.loc[200]

col1    4
col2    5
col3    6
col4    7
Name: 200, dtype: int32

In [20]:
my_frame.loc[200:301]

     col1  col2  col3  col4
200     4     5     6     7
300     8     9    10    11

In [21]:
my_frame.loc[200:401]

     col1  col2  col3  col4
200     4     5     6     7
300     8     9    10    11
400    12    13    14    15

In [25]:
my_frame.loc[[200, 400]]

     col1  col2  col3  col4
200     4     5     6     7
400    12    13    14    15

In [27]:
my_frame['col3'][200]

6

In [28]:
my_frame['col2'][400]

13

# Assigning Values

In [29]:
my_frame

     col1  col2  col3  col4
100     0     1     2     3
200     4     5     6     7
300     8     9    10    11
400    12    13    14    15

In [30]:
my_frame.index.name = 'my_index'

In [31]:
my_frame

          col1  col2  col3  col4
my_index
100          0     1     2     3
200          4     5     6     7
300          8     9    10    11
400         12    13    14    15

In [32]:
my_frame.columns.name = 'id'

In [33]:
my_frame

id        col1  col2  col3  col4
my_index
100          0     1     2     3
200          4     5     6     7
300          8     9    10    11
400         12    13    14    15

In [34]:
my_frame['col5'] = 11
my_frame

id        col1  col2  col3  col4  col5
my_index
100          0     1     2     3    11
200          4     5     6     7    11
300          8     9    10    11    11
400         12    13    14    15    11

In [36]:
my_frame['col5'] = [18, 20, 22, 25]

In [37]:
my_frame

id        col1  col2  col3  col4  col5  col
my_index
100          0     1     2     3    18   18
200          4     5     6     7    20   20
300          8     9    10    11    22   22
400         12    13    14    15    25   25

In [39]:
del my_frame['col']

In [40]:
my_frame

id        col1  col2  col3  col4  col5
my_index
100          0     1     2     3    18
200          4     5     6     7    20
300          8     9    10    11    22
400         12    13    14    15    25

In [46]:
s = pd.Series(np.arange(100, 104))

In [47]:
s

0    100
1    101
2    102
3    103
dtype: int32

In [50]:
my_frame['col6'] = s.values

In [51]:
my_frame

id        col1  col2  col3  col4  col5  col6
my_index
100          0     1     2     3    18   100
200          4     5     6     7    20   101
300          8     9    10    11    22   102
400         12    13    14    15    25   103